Revit 2027 API
RuledFace.Point Property
Profile points of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ this[
	int index
] { get; }
Public ReadOnly Property Point (
	index As Integer
) As XYZ
	Get
public:
property XYZ^ Point[int index] {
	XYZ^ get (int index);
}
member Point : XYZ with get
Parameters
index Int32
Property Value
XYZ
See Also
Reference
RuledFace Class
Autodesk.Revit.DB Namespace